Revit 2026 API

# ParameterTypeIdRbsEnergyAnalysisViewBuildingShellMode Property

---

"Show Analytical Building Shell"

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public static ForgeTypeId RbsEnergyAnalysisViewBuildingShellMode { get; }
```
```vb
Public Shared ReadOnly Property RbsEnergyAnalysisViewBuildingShellMode As ForgeTypeId
	Get
```
```cpp
public:
static property ForgeTypeId^ RbsEnergyAnalysisViewBuildingShellMode {
	ForgeTypeId^ get ();
}
```
```fsharp
static member RbsEnergyAnalysisViewBuildingShellMode : ForgeTypeId with get
```

#### Property Value

ForgeTypeId

#### Reference

ParameterTypeId Class

Autodesk.Revit.DB Namespace